multiRegion/CHT/misalignedDuct/constant/fluid/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18;         // [g/mol]
    }
    equationOfState
    {
        rho         998.19;     // [kg/m^3]
    }
    thermodynamics
    {
        Cv          4150;       // [J/kg/K]
        Hf          0;
    }
    transport
    {
        mu          1.0005e-3;  // [kg/m/s]
        Pr          6.31;
    }
}

// ************************************************************************* //
